{
    "id": "prod_HOtTn1HMUN7lj3",
    "name": "June Vitrual AppSec Days Summer of Security",
    "currency": "usd",
    "products": [
        {
            "id": "sku_HOtVrdqEkulPjf",
            "name": "Training: Hacking Modern Desktop apps: Master the Future of Attack Vectors",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>All action, no fluff, improve your security analysis workflow and immediately apply these gained skills in your workplace, packed with exercises, extra mile challenges and CTF, self-paced and suitable for all skill levels, with continued education via unlimited email support and lifetime access to training portal with step-by-step video recordings. <strong><em>Presented by Abraham Aranguren</em></strong></p>",
                "discountable": "True",
                "display_order": "1"
            }
        },
        {
            "id": "sku_HOtXAQOsswDPcL",
            "name": "Training: Threat Modeling: Getting from None to Done",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>This session offers an interactive introduction to Threat Modeling, based on the instructor's learning and experience over several years. A primary focus of this course is the introduction of threat modeling activities into your organization's software development processes, to improve the overall quality and security of the applications you build. <strong><em>Presented by John DiLeo</em></strong></p>",
                "discountable": "True",
                "display_order": "2"
            }
        },
        {
            "id": "sku_HOtY1f3pVzqopR",
            "name": "Training: Securing Microservices with OAuth 2.0 and OpenID Connect (Hands-On Workshop)",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>OAuth 2.0 and OpenID Connect (OIDC) are the most commonly used solutions for authentication in microservice architectures as of today.<br />\nIn this hands-on training, participants will learn how OAuth 2.0 really works and how it differs from OIDC. We will cover concepts, implementing a client and resource server, automated testing, and best practices. <strong><em>Presented by Andreas Falk</em></strong></p>",
                "discountable": "True",
                "display_order": "3"
            }
        }
    ]
}