{
    "id": "prod_HOtTn1HMUN7lj3",
    "name": "June Vitrual AppSec Days Summer of Security",
    "currency": "usd",
    "products": [
        {
            "id": "sku_HOtVrdqEkulPjf",
            "name": "Training: Hacking Modern Desktop apps: Master the Future of Attack Vectors",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>All action, no fluff, improve your security analysis workflow and immediately apply these gained skills in your workplace, packed with exercises, extra mile challenges and CTF, self-paced and suitable for all skill levels, with continued education via unlimited email support and lifetime access to training portal with step-by-step video recordings. <strong><em>Presented by Abraham Aranguren</em></strong></p>",
                "discountable": "True",
                "display_order": "1"
            }
        },
        {
            "id": "sku_HOtXAQOsswDPcL",
            "name": "Training: Threat Modeling: Getting from None to Done",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>This session offers an interactive introduction to Threat Modeling, based on the instructor's learning and experience over several years. A primary focus of this course is the introduction of threat modeling activities into your organization's software development processes, to improve the overall quality and security of the applications you build. <strong><em>Presented by John DiLeo</em></strong></p>",
                "discountable": "True",
                "display_order": "2"
            }
        },
        {
            "id": "sku_HOtY1f3pVzqopR",
            "name": "Training: Securing Microservices with OAuth 2.0 and OpenID Connect (Hands-On Workshop)",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>OAuth 2.0 and OpenID Connect (OIDC) are the most commonly used solutions for authentication in microservice architectures as of today.<br />\nIn this hands-on training, participants will learn how OAuth 2.0 really works and how it differs from OIDC. We will cover concepts, implementing a client and resource server, automated testing, and best practices. <strong><em>Presented by Andreas Falk</em></strong></p>",
                "discountable": "True",
                "display_order": "3"
            }
        },
        {
            "id": "sku_HOtaQlVL24vBtf",
            "name": "Training: Applied Data Science and Machine Learning For Cyber Security",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>This interactive course will teach security professionals how to use data science techniques to quickly manipulate and analyze security data. The course will cover the entire data science process from data preparation, exploratory data analysis, data visualization, machine learning, and model evaluation—all with a focus on security related problems. <strong><em>Presented by Charles Givre</em></strong></p>",
                "discountable": "True",
                "display_order": "4"
            }
        },
        {
            "id": "sku_HOtd9tZbZM8NWp",
            "name": "Training: Attacking and Defending Containers and Kubernetes",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>Attacking and Securing Applications leveraging containers and Kubernetes requires specific skill set and a deep understanding of the underlying architecture. This Training will be filled with demos and a few hands-on labs designed from real-world attacks to help understand all there is to attack and implement security in a scalable manner. <strong><em>Presented by Nithin Jois</em></strong></p>",
                "discountable": "True",
                "display_order": "5",
                "display_end": "2020-06-18"
            }
        },
        {
            "id": "sku_HOtegNFigCZqb3",
            "name": "Training: Defensive coding in JavaScript",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>Are frameworks adequate to shield your JavaScript front-end apps and Node.js APIs from security attacks? What about the security implications of JavaScript language quirks, V8 constraints, and Node.js design idiosyncrasies? This hands-on course dives into practical knowledge crucial for building, reviewing, or pen-testing today's JavaScript stack. <strong><em>Presented by Chetan Karande</em></strong></p>",
                "discountable": "True",
                "display_order": "6",
                "display_end": "2020-06-18"
            }
        },
        {
            "id": "sku_HOtfqFT5N3fEgg",
            "name": "Training: Don't Run With Scissors: How to protect your developers from hurting themselves with their frameworks",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>In this world we live in, developer education will fail if even one mistake is made, which will expose a dangerous vulnerability. In this training, we’ll show how you can dramatically reduce the chance developers will shoot themselves in the foot by giving them safer versions of their common tools so your company can ship more secure code. <strong><em>Presented by Morgan Roman</em></strong></p>",
                "discountable": "True",
                "display_order": "7"
            }
        },
        {
            "id": "sku_HOtgHmUHYAWbwH",
            "name": "Training: DevSecOps - Automating Security in DevOp",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>A single day course to understand how to inject Security into CI/CD/CM processes of DevOps through practical demonstrations. Audiences will also receive a complete DevSecOps lab containing all the open source tools and scripts using which the entire DevSecOps process has been implemented. <strong><em>Presented by Rohit Salecha</em></strong></p>",
                "discountable": "True",
                "display_order": "8",
                "display_end": "2020-06-18"
            }
        },
        {
            "id": "sku_HOti9nZAVOHV6o",
            "name": "Training: Checkov: Static analysis for infrastructure code",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>Automating policy checks for infrastructure as code prior to deployment is becoming a critical part of the Devops and security CI/CD pipeline. In this training, we’ll cover a simple method to write, test, and maintain infrastructure-as-code at scale using policy-as-code. <strong><em>Presented by Barak Schoster Goihman</em></strong></p>",
                "discountable": "True",
                "display_order": "9",
                "display_end": "2020-06-18"
            }
        },
        {
            "id": "sku_HOtjMDJjghGmHB",
            "name": "Training: Container Security Crash Course",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>In this crash-course, we'll cover container fundamentals focusing on Docker. Topics covered include: building images, security mechanisms in Docker, networking, CICD, vulnerability scanning and running containers alone or with an orchestration system like Kubernetes. The training also includes exercises and labs to provide hands-on experience. <strong><em>Presented by Matt Tesauro</em></strong></p>",
                "discountable": "True",
                "display_order": "10"
            }
        },
        {
            "id": "sku_HOtlF4mbFjqr26",
            "name": "Training: Hacking the Cloud",
            "amount": 49500,
            "metadata": {
                "type": "regular",
                "description": "<p>This compressed version of our hugely popular Hacking and Securing Cloud Infrastructure course cuts through the mystery of Cloud Services (inc AWS, Azure, GCP) to uncover the vulnerabilities that lie beneath. Covering both the theory as well as a number of modern techniques that may be used to compromise various Cloud services and infrastructure. <strong><em>Presented by Anthony Webb</em></strong></p>",
                "discountable": "True",
                "display_order": "11"
            }
        }
    ]
}